# Homework - SQL2

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름: 홍영주
학번: 201403641
학과: 영어학부
제출일: Dec 02, 2020
```

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 각 10점, 18번 20점, 총200점**

In [2]:
%load_ext sql

In [3]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\youngju hong\anaconda3\lib\site-packages (0.10.1)

### Use your host, id, password, and database

In [3]:
import getpass
user = 'hong'
password = getpass.getpass()
host='database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com'
database = ''
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

········

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab on AWS RDS"

In [5]:
%sql USE companydb;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

### 1-13번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

In [25]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E.FNAME, " ", E.MINIT, ". ", E.LNAME) "Employee name"
FROM EMPLOYEE E, WORKS_ON W, PROJECT P
WHERE P.Pname = "ProductX" and W.Pno = P.Pnumber and E.Ssn = W.Essn

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('John B. Smith',), ('Joyce A. English',)]


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)

In [5]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E.FNAME, " ", E.MINIT, ". ", E.LNAME) "Employee name"
FROM EMPLOYEE AS E
WHERE EXISTS (
    SELECT *
    FROM DEPENDENT D
    WHERE E.Sex = D.Sex and E.Ssn = D.Essn
)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('John B. Smith',), ('Franklin T. Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)

In [87]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E1.FNAME, " ", E1.MINIT, ". ", E1.LNAME) "Employee name"
FROM EMPLOYEE AS E1
WHERE EXISTS (
    SELECT *
    FROM EMPLOYEE AS E2
    WHERE E1.Superssn = E2.Ssn AND E2.Fname = "Franklin" and E2.Lname = "Wong"
)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('John B. Smith',), ('Joyce A. English',), ('Ramesh K. Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [38]:
%%sql
-- YOUR CODE HERE

SELECT P.Pname "Project name", SUM(W.Hours) "Total hours"
FROM EMPLOYEE E, PROJECT P, WORKS_ON W
WHERE E.Ssn = W.Essn and P.Pnumber = W.Pno
GROUP BY P.Pname

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[('Computerization', Decimal('55.0')),
 ('Newbenefits', Decimal('55.0')),
 ('ProductX', Decimal('52.5')),
 ('ProductY', Decimal('37.5')),
 ('ProductZ', Decimal('50.0')),
 ('Reorganization', Decimal('25.0'))]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.

In [45]:
%%sql
-- YOUR CODE HERE

SELECT *
FROM EMPLOYEE
WHERE NOT EXISTS (
    SELECT PNUMBER
    FROM PROJECT, DEPARTMENT
    WHERE PROJECT.Dnum = DEPARTMENT.Dnumber and Dname = "Administration" AND NOT EXISTS ( SELECT *
    FROM WORKS_ON
    WHERE PNUMBER=PNO AND ESSN=SSN ) );

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

In [71]:
%%sql

    SELECT *
    FROM PROJECT, DEPARTMENT, EMPLOYEE
    WHERE PROJECT.Dnum = DEPARTMENT.Dnumber and Dname = "Administration"
    AND NOT EXISTS ( SELECT *
    FROM WORKS_ON
    WHERE PNUMBER=PNO AND ESSN=SSN );

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
10 rows affected.

[('Computerization', 10, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Newbenefits', 30, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Newbenefits', 30, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Computerization', 10, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Newbenefits', 30, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Computerization', 10, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('Newbenefits', 30, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('Computerization', 10, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Newbenefits', 30, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Computerization', 10, 'Stafford', 4, 'Administration', 4, '987654321', datetime.date(1995, 1, 1), 'Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4)]

In [60]:
%%sql

SELECT *
FROM EMPLOYEE
WHERE NOT EXISTS (
    SELECT PNUMBER
    FROM PROJECT, DEPARTMENT
    WHERE PROJECT.Dnum = DEPARTMENT.Dnumber and Dname = "Administration" AND NOT EXISTS ( SELECT *
    FROM WORKS_ON
    WHERE PNUMBER=PNO AND ESSN=SSN ) );

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)

In [120]:
%%sql

select *
from EMPLOYEE E
where not exists (
    SELECT *
    FROM WORKS_ON W, PROJECT P
    WHERE P.Plocation = "Houston" and P.Pnumber = W.Pno and E.Ssn = W.Essn )

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [78]:
%%sql
-- YOUR CODE HERE

SELECT DNAME, AVG (SALARY)
FROM DEPARTMENT, EMPLOYEE
WHERE DNUMBER=DNO
GROUP BY DNAME;

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Administration', Decimal('31000.000000')),
 ('Headquarters', Decimal('55000.000000')),
 ('Research', Decimal('33250.000000'))]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)
Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [79]:
%%sql
-- YOUR CODE HERE

SELECT AVG (SALARY)
FROM EMPLOYEE
WHERE SEX='F';

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[(Decimal('31000.000000'),)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [137]:
%%sql
-- YOUR CODE HERE

select *
    FROM EMPLOYEE E
    where exists (
            SELECT *
            FROM WORKS_ON W, PROJECT P
            WHERE P.Plocation = "Houston" and P.Pnumber = W.Pno and E.Ssn = W.Essn )
    AND NOT EXISTS (
            SELECT *
            WHERE Address like "%Houston%")

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4)]

#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

In [187]:
%%sql
-- YOUR CODE HERE

SELECT LNAME, FNAME
    FROM EMPLOYEE
    WHERE EXISTS ( SELECT *
        FROM DEPARTMENT
        WHERE SSN=MGRSSN )
        AND
        NOT EXISTS ( SELECT *
        FROM DEPENDENT
        WHERE SSN=ESSN );

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Borg', 'James')]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

In [188]:
%%sql
-- YOUR CODE HERE

SELECT *
FROM EMPLOYEE
WHERE Dno = 
    (SELECT Dno FROM EMPLOYEE
        WHERE SALARY = (SELECT MAX(SALARY) FROM EMPLOYEE))

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1)]

#### 12-1. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

In [178]:
%%sql
-- YOUR CODE HERE

SELECT *
FROM EMPLOYEE E
WHERE EXISTS (
    SELECT *
    FROM EMPLOYEE E
    WHERE EXISTS (
        SELECT *
        FROM EMPLOYEE E
        WHERE Superssn = (SELECT Ssn FROM EMPLOYEE E WHERE Fname = "James" and Lname = "Borg")
        )
    )

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
8 rows affected.

[('John', 'B', 'Smith', '123456789', datetime.date(1965, 1, 9), '731-Fondren-Houston-TX', 'M', Decimal('30000.00'), '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1972, 7, 31), '5631-Rice-Houston-TX', 'F', Decimal('25000.00'), '333445555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1969, 3, 29), '980-Dallas-Houston-TX', 'M', Decimal('25000.00'), '987654321', 4),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1968, 1, 19), '3321-Castle-Spring-TX', 'F', Decimal('25000.00'), '987654321', 4)]

#### 12-2. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

In [198]:
%%sql
-- YOUR CODE HERE

SELECT CONCAT(E1.Fname, " ", E1.Minit, ". ", E1.Lname) "Employee name"
FROM EMPLOYEE E1, EMPLOYEE E2, EMPLOYEE E3
WHERE E1.Superssn = E2.Ssn
AND E2.Superssn = E3.Ssn
AND E3.Fname = "James"
AND E3.Lname = "Borg"

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 13. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

In [175]:
%%sql
-- YOUR CODE HERE

SELECT *
FROM EMPLOYEE E
WHERE SALARY >= 10000 + (SELECT MIN(SALARY) FROM EMPLOYEE)

 * mysql+pymysql://hong:***@database-1.cwx2mjqzrrdk.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Franklin', 'T', 'Wong', '333445555', datetime.date(1955, 12, 8), '638-Voss-Houston-TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1962, 9, 15), '975-Fire-Oak-Humble-TX', 'M', Decimal('38000.00'), '333445555', 5),
 ('James', 'E', 'Borg', '888665555', datetime.date(1937, 11, 10), '450-Stone-Houston-TX', 'M', Decimal('55000.00'), None, 1),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1941, 6, 20), '291-Berry-Bellaire-TX', 'F', Decimal('43000.00'), '888665555', 4)]

### 14-17번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 14. A view that has the department name, manager name, and manager salary for every department

In [ ]:
%%sql
-- YOUR CODE HERE

In [ ]:
%sql select * from DEPT_VIEW;

#### 15. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

In [ ]:
%%sql
-- YOUR CODE HERE

In [ ]:
%sql select * from RESEARCH_DEPT_VIEW;

#### 16. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

In [ ]:
%%sql
-- YOUR CODE HERE

In [ ]:
%sql select * from PROJECT_VIEW;

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

In [ ]:
%%sql
-- YOUR CODE HERE

In [ ]:
%sql select * from PROJECT_VIEW_GT2;

#### 18. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 18번 문제 Update 한 후에 1-17번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-17번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [ ]:
%%sql
-- YOUR CODE HERE for "create table ..."

In [ ]:
%%sql
-- YOUR CODE HERE for "create trigger ..."

In [ ]:
%sql select * from salary_audit;

In [ ]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

In [ ]:
%sql select * from salary_audit;